tutorials/multiphase/interFoam/laminar/waves/solitaryGrimshaw/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    ( 0.0 0.0 0.0)
    ( 7.0 0.0 0.0)
    ( 7.0 0.55 0.0)
    ( 0.0 0.55 0.0)
    ( 0.0 0.0 0.5)
    ( 7.0 0.0 0.5)
    ( 7.0 0.55 0.5)
    ( 0.0 0.55 0.5)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (350 28 42) simpleGrading (1 1 1)
);
edges
(
);

boundary
(
    left
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    sides
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (3 2 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
